[
  "editing-toolbar",
  "obsidian-emoji-toolbar",
  "obsidian-latex-suite",
  "table-editor-obsidian",
  "obsidian-excalidraw-plugin",
  "mermaid-tools",
  "obsidian-regex-replace",
  "file-explorer-plus",
  "obsidian-dynamic-highlights",
  "obsidian-excel-to-markdown-table",
  "advanced-canvas",
  "theme-picker",
  "mermaid-themes",
  "execute-code",
  "obsidian-pandoc",
  "templater-obsidian"
]